Ran Plan for 3 projects:

1. dir: `Project_1` workspace: `default`
1. dir: `Project_2` workspace: `default`
1. dir: `.` workspace: `default`

### 1. dir: `Project_1` workspace: `default`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vm_creation[0].google_compute_instance.vm1 has been deleted
- resource "google_compute_instance" "vm1" {
      - allow_stopping_for_update = true -> null
      - can_ip_forward            = false -> null
      - cpu_platform              = "Intel Broadwell" -> null
      - creation_timestamp        = "2025-07-01T22:51:31.560-07:00" -> null
      - current_status            = "RUNNING" -> null
      - deletion_protection       = false -> null
      - effective_labels          = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_display            = false -> null
      - id                        = "projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1" -> null
      - instance_id               = "7709132116571289100" -> null
      - label_fingerprint         = "vezUS-42LLM=" -> null
      - machine_type              = "e2-standard-4" -> null
      - metadata                  = {
          - "ssh-keys" = <<-EOT
                rocky:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDCJUnEXVij0etERGHebfRZ/hFgPkC89tSJvm/3O50SAbeMfcucyhKKDZiNlsVSM6N1dwzlM12EWq2ESW2ZyEdrLwbJclu6FCz6WGxRJXUSSIFoxpbJTp2xKbJxLlze9nsWUJ1IAY1UnHXH7oDY5aKimK7P+ixRZ0vOY24WgfmypU6nmWZNZ5kLQoVmK3xeJ+oLkMTSab6Si3XRDHBWAnLnlbKSxxMClDcmlE2AIU7TcUw0bMWm/F4mis0cICWuR/Z4rsW2iEAkv655mwK4NOsxiC0nUJnOaBjMA5FZwg+zA0xOGus1OR09OBtWGBruzcMRHyx0nCzmfwQKKo8fjEUpTDM+XCBi06cElhqlfIkaTcVo/hlWGktHnYheSgg8MaEsNrp2UrL7JE9rMaYrm87v4QhzRbwzTTuiQEPKLNm91S289QozKCB7CmvWbGdt0W5Jm+LvSc+J4XRGJMjNmcKOj0LANjrQ5IftzIa4sAAxm1BFhh6eT52GQKb7I80Ui2k= yashwanthm@Yashwanths-MacBook-Pro-2.local
            EOT
        } -> null
      - metadata_fingerprint      = "EgwOpssuD4E=" -> null
      - name                      = "gcloud-vm-using-atlantis-p1" -> null
      - project                   = "terraform-gcp-463406" -> null
      - self_link                 = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/zones/asia-southeast1-a/instances/gcloud-vm-using-atlantis-p1" -> null
      - tags                      = [
          - "http-server",
          - "https-server",
          - "ssh",
        ] -> null
      - tags_fingerprint          = "xEi19su0rvw=" -> null
      - terraform_labels          = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - zone                      = "asia-southeast1-a" -> null

      - boot_disk {
          - auto_delete       = true -> null
          - device_name       = "persistent-disk-0" -> null
          - force_attach      = false -> null
          - guest_os_features = [
              - "UEFI_COMPATIBLE",
              - "VIRTIO_SCSI_MULTIQUEUE",
              - "GVNIC",
              - "SEV_CAPABLE",
              - "SEV_SNP_CAPABLE",
              - "SEV_LIVE_MIGRATABLE",
              - "SEV_LIVE_MIGRATABLE_V2",
              - "IDPF",
              - "TDX_CAPABLE",
            ] -> null
          - mode              = "READ_WRITE" -> null
          - source            = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/zones/asia-southeast1-a/disks/gcloud-vm-using-atlantis-p1" -> null

          - initialize_params {
              - architecture                = "X86_64" -> null
              - enable_confidential_compute = false -> null
              - image                       = "https://www.googleapis.com/compute/v1/projects/rocky-linux-cloud/global/images/rocky-linux-9-v20250611" -> null
              - labels                      = {} -> null
              - provisioned_iops            = 0 -> null
              - provisioned_throughput      = 0 -> null
              - resource_policies           = [] -> null
              - size                        = 20 -> null
              - type                        = "pd-standard" -> null
            }
        }

      - network_interface {
          - internal_ipv6_prefix_length = 0 -> null
          - name                        = "nic0" -> null
          - network                     = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/global/networks/default" -> null
          - network_ip                  = "10.148.0.15" -> null
          - queue_count                 = 0 -> null
          - stack_type                  = "IPV4_ONLY" -> null
          - subnetwork                  = "https://www.googleapis.com/compute/v1/projects/terraform-gcp-463406/regions/asia-southeast1/subnetworks/default" -> null
          - subnetwork_project          = "terraform-gcp-463406" -> null

          - access_config {
              - nat_ip       = "35.198.211.205" -> null
              - network_tier = "PREMIUM" -> null
            }
        }

      - scheduling {
          - automatic_restart   = true -> null
          - availability_domain = 0 -> null
          - min_node_cpus       = 0 -> null
          - on_host_maintenance = "MIGRATE" -> null
          - preemptible         = false -> null
          - provisioning_model  = "STANDARD" -> null
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vm_creation[0].google_compute_instance.vm1 will be created
+ resource "google_compute_instance" "vm1" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + creation_timestamp        = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + effective_labels          = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-standard-4"
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                rocky:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDCJUnEXVij0etERGHebfRZ/hFgPkC89tSJvm/3O50SAbeMfcucyhKKDZiNlsVSM6N1dwzlM12EWq2ESW2ZyEdrLwbJclu6FCz6WGxRJXUSSIFoxpbJTp2xKbJxLlze9nsWUJ1IAY1UnHXH7oDY5aKimK7P+ixRZ0vOY24WgfmypU6nmWZNZ5kLQoVmK3xeJ+oLkMTSab6Si3XRDHBWAnLnlbKSxxMClDcmlE2AIU7TcUw0bMWm/F4mis0cICWuR/Z4rsW2iEAkv655mwK4NOsxiC0nUJnOaBjMA5FZwg+zA0xOGus1OR09OBtWGBruzcMRHyx0nCzmfwQKKo8fjEUpTDM+XCBi06cElhqlfIkaTcVo/hlWGktHnYheSgg8MaEsNrp2UrL7JE9rMaYrm87v4QhzRbwzTTuiQEPKLNm91S289QozKCB7CmvWbGdt0W5Jm+LvSc+J4XRGJMjNmcKOj0LANjrQ5IftzIa4sAAxm1BFhh6eT52GQKb7I80Ui2k= yashwanthm@Yashwanths-MacBook-Pro-2.local
            EOT
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "gcloud-vm-using-atlantis-p1"
      + project                   = "terraform-gcp-463406"
      + self_link                 = (known after apply)
      + tags                      = [
          + "http-server",
          + "https-server",
          + "ssh",
        ]
      + tags_fingerprint          = (known after apply)
      + terraform_labels          = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                      = "asia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "rocky-linux-9-v20250611"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = 20
              + snapshot               = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config {
          + confidential_instance_type  = (known after apply)
          + enable_confidential_compute = (known after apply)
        }

      + guest_accelerator {
          + count = (known after apply)
          + type  = (known after apply)
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + availability_domain         = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)
          + termination_time            = (known after apply)

          + local_ssd_recovery_timeout {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + max_run_duration {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }

          + on_instance_stop_action {
              + discard_local_ssd = (known after apply)
            }
        }
    }

  # module.vm_creation[0].null_resource.run_ansible is tainted, so must be replaced
-/+ resource "null_resource" "run_ansible" {
      ~ id = "5131823079778489485" -> (known after apply)
    }

  # module.vm_creation[0].null_resource.wait_for_ssh must be replaced
-/+ resource "null_resource" "wait_for_ssh" {
      ~ id       = "2188522532138980063" -> (known after apply)
      + triggers = {
          + "always_run" = (known after apply)
        } # forces replacement
    }

Plan: 3 to add, 0 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Project_1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252FProject_1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Project_1`
</details>
Plan: 3 to add, 0 to change, 2 to destroy.

---
### 2. dir: `Project_2` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Project_2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252FProject_2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Project_2`

---
### 3. dir: `.` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
